In [2]:
import pandas as pd
import numpy as np

# Ejercicio 16: Identificación de valores nulos en un DataFrame

In [3]:
# Crear un DataFrame de ejemplo con valores nulos
data = {'A': [1, 2, np.nan, 4], 'B': [5, np.nan, 7, 8], 'C': [9, 10, 11, np.nan]}
df = pd.DataFrame(data)

df

     A    B     C
0  1.0  5.0   9.0
1  2.0  NaN  10.0
2  NaN  7.0  11.0
3  4.0  8.0   NaN

In [4]:
# Mostrar la máscara booleana de valores nulos en el DataFrame

mascara_valores_nulos = pd.isna(df)

mascara_valores_nulos

       A      B      C
0  False  False  False
1  False   True  False
2   True  False  False
3  False  False   True

# Ejercicio 17: Verificación de valores no nulos en un DataFrame

In [5]:
# Mostrar la máscara booleana de valores no nulos en el DataFrame

valores_no_nulos = pd.notna(df)

valores_no_nulos

       A      B      C
0   True   True   True
1   True  False   True
2  False   True   True
3   True   True  False

# Ejercicio 18: Obtener valores únicos de una columna en un DataFrame

In [9]:
# Crear un DataFrame de ejemplo
data = {'Dia': ['Lunes', 'Martes', 'Miércoles', 'Martes', 'Jueves']}
df2 = pd.DataFrame(data)

df2

         Dia
0      Lunes
1     Martes
2  Miércoles
3     Martes
4     Jueves

In [10]:
# Mostrar los valores únicos en la columna 'Día'

unicos_dias = pd.unique(df2['Dia'])

unicos_dias

array(['Lunes', 'Martes', 'Miércoles', 'Jueves'], dtype=object)

# Ejercicio 19: Verificación de valores nulos en una Serie

In [11]:
# Crear una Serie de ejemplo con valores nulos
serie = pd.Series([1, 2, np.nan, 4])

In [12]:
# Verificar si la Serie tiene valores nulos
valores_nulos_serie = serie.hasnans

valores_nulos_serie

True

# Ejercicio 20: Eliminación de filas con valores nulos en un DataFrame

In [13]:
# Crear un DataFrame de ejemplo con valores nulos
data = {'A': [1, 2, np.nan, 4], 'B': [5, np.nan, 7, 8], 'C': [9, 10, 11, np.nan]}
df3 = pd.DataFrame(data)

In [14]:
# Eliminar filas con valores nulos
filas_valores_nulos = df3.dropna()

filas_valores_nulos

     A    B    C
0  1.0  5.0  9.0

# Ejercicio 21: Relleno de valores nulos en un DataFrame

In [15]:
# Crear un DataFrame de ejemplo con valores nulos
data = {'A': [1, 2, np.nan, 4], 'B': [5, np.nan, 7, 8], 'C': [9, 10, np.nan, 12]}
df4 = pd.DataFrame(data)

In [16]:
# Rellenar valores nulos con 0 en todo el DataFrame

rellenar_valores_nulos = df.fillna(0)
rellenar_valores_nulos

     A    B     C
0  1.0  5.0   9.0
1  2.0  0.0  10.0
2  0.0  7.0  11.0
3  4.0  8.0   0.0

# Ejercicio 22: Interpolación lineal en una Serie

In [19]:
# Crear una Serie de ejemplo con valores nulos
serie1 = pd.Series([1, 2, np.nan, 4])

In [20]:
# Interpolar valores nulos en la Serie
serie_interpolada = serie1.interpolate()

serie_interpolada

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

# Ejercicio 23: Eliminación de filas duplicadas en un DataFrame

In [21]:
# Crear un DataFrame de ejemplo con filas duplicadas
data = {'A': [1, 2, 2, 4], 'B': [5, 6, 6, 8], 'C': [9, 10, 10, 12]}
df5 = pd.DataFrame(data)

In [22]:
# Eliminar filas duplicadas basándose en todas las columnas

df5_no_duplicado = df5.drop_duplicates()

df5_no_duplicado

   A  B   C
0  1  5   9
1  2  6  10
3  4  8  12

# Ejercicio 24: Verificación de orden monotónico en una Serie

In [26]:
# Crear una Serie de ejemplo
serie4 = pd.Series([1, 2, 3, 4, 5])

In [28]:
es_monotinico = serie4.is_monotonic_increasing
es_monotinico

True

# Ejercicio 25: Eliminación de filas por etiquetas en un DataFrame

In [29]:
# Crear un DataFrame de ejemplo
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df6 = pd.DataFrame(data)

In [30]:
# Lista de etiquetas de filas a eliminar

etiquetas_a_eliminar = [0,2]

In [31]:
# Eliminar filas por etiquetas

eliminar_filas_por_etiquetas = df6.drop(etiquetas_a_eliminar)

eliminar_filas_por_etiquetas

   A  B
1  2  5

# Ejercicio 26: Identificación de filas duplicadas en un DataFrame